# tap (formula / A Git repository of Formula and/or commands)
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'sanemat/font'
tap 'shopify/shopify'

# brew (mainly CLI tools)
# brew 'bat'
# brew 'cmake'
# brew 'gcc'
# brew 'geckodriver'
brew 'gh'
brew 'hadolint'
brew 'jq'
brew 'peco'
brew 'postgresql@14', restart_service: true
brew 'redis'
brew 'telnet'
brew 'tree'
brew 'wget'
# brew 'yarn' # see README
brew 'zsh'
brew 'zsh-completions'
brew 'awscli'
brew 'saml2aws'
brew 'asdf'
brew 'kubectl'
brew 'minikube'
brew 'kube-ps1'
brew 'kubectx'
brew 'stern'
brew 'tmux'

# cask (An extension of homebrew to install macOS native apps)
cask_args appdir: '/Applications'

# Utiliity
cask 'notion'
cask 'karabiner-elements'

# Productivity
cask 'alfred'

# Passwords, VPN
cask '1password'

# Browser
cask 'firefox'

# Development/Work
cask 'adobe-creative-cloud'
cask 'chromedriver'
cask 'jetbrains-toolbox'
cask 'ngrok'
cask 'postman'
cask 'visual-studio-code'
cask 'iterm2'
cask 'sequel-ace'

# Virtual Machines (& Docker)
cask 'docker'

# Communication/Social
cask 'discord'
cask 'slack'
cask 'zoom'

# Fonts
cask 'font-hack-nerd-font'

# Media
cask 'kindle'
cask 'webpquicklook' # for webp files