# tap (formula / A Git repository of Formula and/or commands)
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'sanemat/font'
tap 'shopify/shopify'

# brew (mainly CLI tools)
brew 'bat'
brew 'boost'
brew 'cmake'
brew 'gcc'
brew 'geckodriver'
brew 'gh'
brew 'git'
brew 'go'
brew 'hadolint'
brew 'hugo'
brew 'jq'
# brew 'mas'
brew 'mysql'
brew 'nvm'
brew 'postgresql', restart_service: true
brew 'pyenv'
brew 'ruby-build'
brew 'rbenv'
brew 'redis'
brew 'rustup-init'
brew 'telnet'
brew 'tfenv'
brew 'tree'
brew 'vim'
brew 'watchman'
brew 'wget'
# brew 'yarn' # see README
brew 'zsh'
brew 'zsh-completions'
brew 'sanemat/font/ricty', args: ['with-powerline']
brew 'shopify/shopify/themekit'

# cask (An extension of homebrew to install macOS native apps)
cask_args appdir: '/Applications'

# Utiliity
cask 'deepl'
cask 'notion'
cask 'karabiner-elements'

# Productivity
cask 'alfred'

# Passwords, VPN
cask '1password'
cask 'keybase'
cask 'tunnelblick'

# Browser
cask 'firefox'
cask 'google-chrome'
cask 'brave-browser'
cask 'microsoft-edge'
cask 'biscuit' # for managing multiple email accounts

# Development/Work
cask 'adobe-creative-cloud'
cask 'chromedriver'
cask 'hyper'
cask 'jetbrains-toolbox'
cask 'ngrok'
cask 'postman'
cask 'visual-studio-code'
cask 'visual-studio'

# Virtual Machines (& Docker)
cask 'docker'
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'
# cask 'vagrant'
# cask 'vmware-fusion'

# Communication/Social
cask 'discord'
cask 'slack'
cask 'zoomus'

# Fonts
cask 'font-fira-code'
cask 'font-hack-nerd-font'

# Media
cask 'kindle'
cask 'webpquicklook' # for webp files

# Gamings
cask 'twitch'
cask 'steam'
